---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SweepBaseRoofSubcategoryId
source: html/c22a6ddb-2b31-a06b-6092-5dbc19e0dc01.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SweepBaseRoofSubcategoryId Property

"Subcategory of Roofs"

## Syntax (C#)
```csharp
public static ForgeTypeId SweepBaseRoofSubcategoryId { get; }
```